<template>
  <div class="layout">
    <Head>
      <Title>ПарфБюро - оригиналы мировых брендов</Title>
      <Link
        rel="icon"
        href="https://parfburo.com/favicon.ico"
        type="image/x-icon"
      />
    </Head>
    <Header @login="isLoginModal = true" @openShopBag="isDrawer = true" />
    <div class="main">
      <slot />
      <Footer @onInfoModal="val => (infoModal = val)" />
    </div>
    <mobile-panel @login="isLoginModal = true" @openShopBag="isDrawer = true" />
    <UiModal
      v-if="infoModal === 'delivery'"
      @close="infoModal = null"
      header="Доставка"
    >
      <div class="modal-body">
        <p>
          Мы осуществляем курьерскую доставку до двери в г. Москва и г. Рязань.
        </p>
        <p>
          В другие регионы России доставка осуществляется с помощью транспортной
          компании CDEK. Мы надежно упаковываем каждый заказ, чтобы при
          транспортировке он не повредился.
        </p>
        <p class="mt-2">Стоимость доставки:</p>
        <ul>
          <li>
            📍 Доставка по России транспортной компанией CDEK (оплата на сайте)
            - 400₽ при заказе до 7000₽, бесплатно при заказе от 7000₽
          </li>
          <li class="mt-1">
            📍 Доставка по Москве в пределах МКАД курьером (оплата при получении
            наличными/оплата на сайте) - 500₽ при заказе до 10.000₽, бесплатно
            при заказе от 10.000₽
          </li>
          <li class="mt-1">
            📍 Доставка по Москве за пределы МКАД курьером (оплата наличными при
            получении/оплата на сайте) - рассчитывается индивидуально. 800₽ +
            25₽ за каждый километр удаленности от МКАД
          </li>
          <li class="mt-1">
            📍 Доставка по Рязани в пределах города, Яндекс.Go (оплата на сайте)
            При заказе до 10.000₽ - 350₽, при заказе от 10.000₽ - бесплатно
          </li>
        </ul>
      </div>
    </UiModal>
    <UiModal
      v-if="infoModal === 'about'"
      @close="infoModal = null"
      header="О нас"
    >
      <div class="modal-body">
        <p>
          Привет! Мы - Парфюм Бюро, твой персональный байер в мире парфюмерии.
        </p>
        <p class="mt-2">Принципы нашей работы очень просты:</p>
        <ul>
          <li>
            Только оригинальная продукция. Мы заказываем ароматы у
            дистрибьюторов, которые завозят их в Россию напрямую с заводов
            производителей. Да, эти же ароматы попадают на полки крупных
            парфюмерных сетей. Мы приветствуем любые проверки на оригинальность,
            чтобы у вас остались только положительные эмоции от покупки.
          </li>
          <li class="mt-1">
            Политика умеренных цен. Мы за долгую дружбу с вами. Отказываясь от
            расходов сетевых магазинов и закупая товар в большом объеме, мы
            можем сделать цену выгоднее. Таким образом, у вас есть возможность
            не переплачивать.
          </li>
        </ul>
        <p><b>Почему нет нужного мне аромата/бренда?</b></p>
        <p>
          Наш ассортимент насчитывает более 30000 наименований, возможно, мы еще
          не добавили нужную вам позицию на сайт. Всегда рады ответить на ваш
          запрос наличия и стоимости любого флакона в Telegram/WhatsApp, прямые
          контакты указаны внизу страницы. Если у вас остались вопросы после
          прочтения, мы всегда на связи!
        </p>
      </div>
    </UiModal>
    <shop-bag v-if="isDrawer" :user="user" @close="isDrawer = false" />
    <log-in
      v-if="isLoginModal"
      @close="isLoginModal = false"
      @success="$router.push('userCard')"
    />
  </div>
</template>

<script>
import { getMe, addToFavorites } from '@/api/productApi.js';
import MobilePanel from '~/components/MobilePanel.vue';
import ShopBag from '~/components/ShopBag.vue';
import LogIn from '~/components/LogIn.vue';

export default {
  components: { MobilePanel, ShopBag, LogIn },
  data() {
    return {
      isModal: false,
      token: null, // Хранит значение токена, если он есть
      user: null,
      favorites: [],
      infoModal: '',
      isDrawer: false,
      isLoginModal: false,
    };
  },
  mounted() {
    this.user = useState('user', () => null);
    this.getMe();
    useState('ordersSlugs', () => {
      const slugs = window.localStorage.getItem('ordersSlugs');
      return slugs ? slugs.split(',') : [];
    });
    this.favorites = useState('favoritesSlugs', () => []);
  },
  watch: {
    favorites(val) {
      if (val.length) {
        this.addToFavorites(val);
      }
    },
  },
  methods: {
    onInfoModal(modal) {
      if (modal === 'delivery') {
        this.isDeliveryModal = true;
      }
    },
    async getMe() {
      try {
        const res = await getMe();
        this.user = res;
      } catch (e) {
        console.error(e);
      }
    },
    async addToFavorites(slug) {
      try {
        const res = await addToFavorites(slug);
      } catch (e) {
        console.error(e);
      }
    },
  },
};
</script>

<style scoped lang="scss">
.layout {
  display: flex;
  flex-direction: column;
  overflow: auto;
  height: 100vh;
}

.main {
  overflow: auto;
  height: calc(100vh - 50px);
}

.modal-body {
  padding: 0 20px;
  margin-bottom: 20px;
  max-width: 600px;
  overflow: auto;
  display: flex;
  flex-direction: column;
  gap: 12px;
  font-size: 14px;
}

@media (max-width: 500px) {
  .main {
    margin-bottom: 60px;
  }
}
</style>
