<template>
  <div class="main">
    <h3>Договор оферты</h3>

    <h3>
      Публичная оферта (предложение) интернет-магазина «Парфбюро» о продаже
      товаров
    </h3>

    <h4>Основные понятия:</h4>
    <ul>
      <li>
        <strong>Посетитель Сайта</strong> — лицо, пришедшее на сайт
        <a href="https://parfburo.com">https://parfburo.com</a> без цели
        размещения Заказа.
      </li>
      <li>
        <strong>Пользователь</strong> — физическое лицо, посетитель Сайта,
        принимающий условия настоящей Оферты и желающий разместить Заказы в
        Интернет-магазине
        <a href="https://parfburo.com">https://parfburo.com</a>.
      </li>
      <li>
        <strong>Покупатель</strong> — лицо, акцептовавшее публичную оферту на
        условиях настоящей оферты, размещающее заказы и приобретающее товары у
        <a href="https://parfburo.com">https://parfburo.com</a>, которые
        представлены на сайте для своих личных, бытовых и других нужд, не
        связанных с осуществлением предпринимательской деятельности.
      </li>
      <li>
        <strong>Продавец</strong> — «Парфбюро», ИП Демин Михаил Михайлович, ИНН:
        621504323474, ОГРНИП: 321623400003805.
      </li>
      <li>
        <strong>Сайт</strong> —
        <a href="https://parfburo.com">https://parfburo.com</a> -
        Интернет-магазин, принадлежащий Продавцу, расположенный на сервере в г.
        Москва.
      </li>
      <li>
        <strong>Товар</strong> — объект материального мира, не изъятый из
        гражданского оборота и представленный к продаже на Сайте.
      </li>
      <li>
        <strong>Заказ</strong> — должным образом оформленный и размещенный
        запрос Пользователя, Покупателя на приобретение и доставку по указанному
        адресу.
      </li>
      <li>
        <strong>Акцепт</strong> — Акцептом настоящей Публичной оферты считается
        оформление Покупателем заказа на Товар в соответствии с условиями
        Публичной оферты.
      </li>
    </ul>

    <h4>1. Общие положения</h4>
    <p>
      1.1. Продавец осуществляет продажу Товаров через Интернет-магазин по
      адресу: <a href="https://parfburo.com">https://parfburo.com</a>.
    </p>
    <p>
      1.2. Заказывая Товары через Интернет-магазин, Пользователь соглашается с
      условиями продажи Товаров, изложенными ниже (далее — Условия продажи
      товаров).
    </p>
    <p>
      1.3. Настоящие Условия продажи товаров, а также информация о Товаре,
      представленная на Сайте, являются публичной офертой в соответствии со
      ст.435 и п.2 ст.437 Гражданского кодекса Российской Федерации.
    </p>
    <p>
      1.4. Публичная оферта может быть изменена Продавцом в одностороннем
      порядке без уведомления Пользователя/Покупателя.
    </p>
    <p>
      1.5.1. Публичная оферта признается акцептованной Посетителем Сайта /
      Покупателем с момента оформления Покупателем Заказа без авторизации на
      Сайте.
    </p>
    <p>
      1.5.2. Договор, заключаемый на основании акцептирования Покупателем
      настоящей оферты, является договором присоединения.
    </p>
    <p>
      1.5.3. Факт оформления заказа Покупателем является безоговорочным фактом
      принятия Покупателем условий данного Договора.
    </p>
    <p>
      1.7. Сообщая Продавцу свой e-mail и номер телефона, Посетитель Сайта,
      Покупатель дает согласие на использование указанных средств связи
      Продавцом.
    </p>
    <p>
      1.8. Осуществляя Заказ, Покупатель соглашается с тем, что Продавец может
      поручить исполнение Договора третьему лицу.
    </p>
    <p>
      1.9. Покупатель может оформить заказ в Интернет-магазине
      <a href="https://parfburo.com">https://parfburo.com</a> в любое время,
      кроме периодов проведения регламентных работ или технических сбоев.
    </p>
    <p>
      1.10. Вся текстовая информация и графические изображения товаров,
      размещаемых на Сайте, являются собственностью Продавца или его
      контрагентов.
    </p>

    <h4>2. Предмет</h4>
    <p>
      2.1. Предметом настоящей Публичной оферты является предоставление
      возможности Пользователю приобретать для личных нужд Товары,
      представленные на Сайте.
    </p>
    <p>
      2.2. Данная Публичная оферта распространяется на все виды Товаров и услуг,
      представленных на Сайте.
    </p>

    <h4>3. Товар и порядок совершения покупки</h4>
    <p>
      3.1. Продавец не несет ответственности за точность и правильность
      информации, предоставляемой Пользователем при заказе товара.
    </p>
    <p>
      3.2. Общение Пользователя/Покупателя с менеджерами должно строиться на
      принципах общепринятой морали и коммуникационного этикета.
    </p>
    <p>
      3.3. В случае отсутствия заказанных Покупателем Товаров на складе Продавец
      вправе исключить указанный Товар из Заказа.
    </p>
    <p>
      3.4. В случае аннуляции полностью предоплаченного Заказа стоимость
      аннулированного Товара возвращается Продавцом Покупателю.
    </p>

    <h4>4. Доставка заказа</h4>
    <p>
      4.1. Способы, а также примерные сроки доставки Товаров указаны на Сайте в
      разделе «Доставка».
    </p>
    <p>
      4.2. Доставка товара в отдельные страны может быть ограничена
      законодательством страны доставки.
    </p>
    <p>
      4.3. Продавец не несет ответственность за возможные задержки в доставке
      ввиду непредвиденных обстоятельств.
    </p>

    <h4>5. Оплата товара</h4>
    <p>
      5.1. Цены на Товар определяются Продавцом в одностороннем порядке и
      указываются на страницах интернет-магазина.
    </p>
    <p>
      5.2. Цена Товара на Сайте может быть изменена Продавцом в одностороннем
      порядке.
    </p>
    <p>
      5.3. Произвести оплату Покупатель может способами, указанными на странице
      заказа.
    </p>

    <h4>6. Возврат и обмен товара и денежных средств</h4>
    <p>
      6.1.1. Возврат или обмен товара возможен в течение 7 дней после получения
      товара.
    </p>
    <p>
      6.1.3. Возврат или обмен товара возможны, когда сохранены его товарный
      вид, потребительские свойства и документ, подтверждающий факт покупки.
    </p>

    <h4>7. Ответственность</h4>
    <p>
      7.1. Продавец не несет ответственности за ущерб, причиненный Покупателю
      вследствие ненадлежащего использования Товаров.
    </p>

    <h4>8. Защита персональных данных</h4>
    <p>
      8.1. Персональные данные Пользователя/Покупателя обрабатываются в
      соответствии с Федеральным законом «О персональных данных» № 152-ФЗ.
    </p>
    <p>
      8.4. Продавец имеет право отправлять информационные, в том числе рекламные
      сообщения, на электронную почту и мобильный телефон
      Пользователя/Покупателя с его согласия.
    </p>
  </div>
</template>

<script>
export default {};
</script>

<style scoped lang="scss">
.main {
  height: 100%;
  display: flex;
  flex-direction: column;
  padding: 20px;
  overflow: scroll;
}

h2 {
  margin-bottom: 12px;
}

h4 {
  margin-top: 12px;
  margin-bottom: 8px;
}
</style>
